## Terraform Plan for `infrastructure/global/email`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ses.aws_ses_domain_identity.ses_domain[0]: Refreshing state... [id=servicios-cires.net]
aws_sns_topic.ses_bounces: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:ses-bounces]
aws_ses_receipt_rule_set.default: Refreshing state... [id=default-rule-set]
aws_route53_record.mx: Refreshing state... [id=Z06509101Z22NMKSMXDLL_servicios-cires.net_MX]
aws_sns_topic.email_replies: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:email-replies]
aws_sns_topic.ses_complaints: Refreshing state... [id=arn:aws:sns:us-east-1:668144156539:ses-complaints]
aws_s3_bucket.bounce_processor_source_code: Refreshing state... [id=cires-ses-bouce-processor-code]
module.ses.aws_ses_domain_dkim.ses_domain_dkim[0]: Refreshing state... [id=servicios-cires.net]
module.ses.aws_route53_record.amazonses_verification_record[0]: Refreshing state... [id=Z06509101Z22NMKSMXDLL__amazonses.servicios-cires.net_TXT]
aws_ses_active_receipt_rule_set.active: Refreshing state... [id=default-rule-set]
aws_ses_receipt_rule.email_forwarding_rule: Refreshing state... [id=forward-incoming-to-sns]
aws_ses_identity_notification_topic.bounce_topic: Refreshing state... [id=arn:aws:ses:us-east-1:668144156539:identity/servicios-cires.net|Bounce]
module.ses.aws_route53_record.amazonses_dkim_record[1]: Refreshing state... [id=Z06509101Z22NMKSMXDLL_rmezm25un2wzzsjtpqroy6y7acjrqbfl._domainkey.servicios-cires.net_CNAME]
module.ses.aws_route53_record.amazonses_dkim_record[0]: Refreshing state... [id=Z06509101Z22NMKSMXDLL_clqy32zupqepl55vvvwqadlaxrv3bvnk._domainkey.servicios-cires.net_CNAME]
module.ses.aws_route53_record.amazonses_dkim_record[2]: Refreshing state... [id=Z06509101Z22NMKSMXDLL_2se4znqcj7quk6vvuxogcaoz5nguzbti._domainkey.servicios-cires.net_CNAME]
aws_ses_identity_notification_topic.complaint_topic: Refreshing state... [id=arn:aws:ses:us-east-1:668144156539:identity/servicios-cires.net|Complaint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.bounce_processor_role will be created
  + resource "aws_iam_role" "bounce_processor_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ses_bounce_processor_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.bounce_processor_policy will be created
  + resource "aws_iam_role_policy" "bounce_processor_policy" {
      + id          = (known after apply)
      + name        = "ses_bounce_processor_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lambda_function.bounce_processor will be created
  + resource "aws_lambda_function" "bounce_processor" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "ses-bounce-processor"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "cires-ses-bouce-processor-code"
      + s3_key                         = "bounce-processor.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "tKebf9zhIA5zqoZBqkzOtgYfKx7gUvgLsiJb4RF95Mw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.sns_to_lambda will be created
  + resource "aws_lambda_permission" "sns_to_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ses-bounce-processor"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:us-east-1:668144156539:ses-bounces"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_sns_topic.readable_notifications will be created
  + resource "aws_sns_topic" "readable_notifications" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "ses-readable-notifications"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.lambda_to_raw will be created
  + resource "aws_sns_topic_subscription" "lambda_to_raw" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:668144156539:ses-bounces"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Daniel-Ibarrola, Action: `pull_request`*